
export const equipments = {
  'Weapons': [
    { "id": 1100, "name": "凡铁剑", "desc": "凡人武者常用的铁剑，由精金石打造，削铁如泥，锋利无比。", "grade": 1, "effect": "攻击力微量提升" },
    { "id": 1101, "name": "符纹快刀", "desc": "铭刻了加速符文的长刀，出招迅捷。", "grade": 2, "effect": "攻速提升" },
    { "id": 1102, "name": "寒铁剑", "desc": "取深山寒铁精炼而成，自带丝丝凉意。", "grade": 3, "effect": "攻击力提升" },
    { "id": 1103, "name": "流云匕", "desc": "如云朵般轻灵，难以被察觉的暗杀利器。", "grade": 4, "effect": "暴击率提升" },
    { "id": 1104, "name": "碧波剑", "desc": "剑身通体碧绿，挥舞间似有波涛之声。", "grade": 5, "effect": "水系威力提升" },
    { "id": 1106, "name": "紫薇软剑", "desc": "以星辰砂炼制，刚柔并济，变幻莫测。", "grade": 7, "effect": "全属性加成" },
    { "id": 1107, "name": "青尺剑", "desc": "李尺泾的配剑，青光湛然，生机与杀机并存。", "grade": 4, "effect": "剑法威力提升 30%" },
    { "id": 1108, "name": "羲和重剑", "desc": "传闻蕴含大日金乌之火，重若万钧。", "grade": 9, "effect": "极致破坏力" }
  ],
  'Armors': [
    { "id": 1120, "name": "玄铁甲", "desc": "以精铁融合少量玄铁打造，重而坚固，凡人难伤。", "grade": 2, "effect": "防御力提升" },
    { "id": 1121, "name": "流光道袍", "desc": "丝线上涂抹了灵粉，能偏转部分法术攻击。", "grade": 3, "effect": "法术抗性提升" }
  ],
  'Accessories': [
    { "id": 1109, "name": "望月玉佩", "desc": "望月李氏家主象征，佩戴可宁神定志，阻挡心魔。", "grade": 9, "effect": "突破概率提升 5%" }
  ],
  'Treasures': [
    { "id": 1105, "name": "镇海印", "desc": "厚重如山，能镇压一方水土灵气。", "grade": 6, "effect": "防御力大幅提升" },
    { "id": 1110, "name": "昊天镜残片", "desc": "老祖神器的碎片，即便是一角也拥有鬼神莫测之能。", "grade": 9, "effect": "悟性 +10" }
  ]
};
