export const RECIPES_DATA = {
  "Alchemy": [
    {
       "id": 1500,
       "name": "养元散丹方",
       "grade": 0,
       "productId": 1203,
       "turns": 1,
       "cost": { "1302": 4, "1300": 3 },
       "desc": "温养经脉，恢复气血，适合初入修行者调理根基。"
    },
    {
      "id": 1501,
      "name": "凝气丹丹方",
      "grade": 1,
      "productId": 1202,
      "turns": 1,
      "cost": { 1300: 5, 1301: 2 }, // 灵谷草, 清灵花
      "desc": "提练气修士精进修为的资粮。丹内锁有一团纯净的灵雾，吞服后可省却数月打坐吐纳之功，乃是望月湖各大家族争相囤积的战略物资。"
    },
    {
        "id": 1502,
        "name": "回气丸丹方",
        "grade": 1,
        "productId": 1204,
        "turns": 1,
        "cost": { "1301": 3, "1303": 1 },
        "desc": "短时间内回复灵力，常备于外出历练之时。"
    },
    {
        "id": 1503,
        "name": "健体丹丹方",
        "grade": 0,
        "productId": 1205,
        "turns": 1,
        "cost": { "1304": 5 },
        "desc": "强筋健骨，改善凡人体魄，为踏入修行打下基础。"
    },
    {
        "id": 1504,
        "name": "清心丸丹方",
        "grade": 1,
        "productId": 1206,
        "turns": 1,
        "cost": { "1301": 2, "1305": 2 },
        "desc": "安神定志，减少修炼时心浮气躁的风险。"
    },
    {
        "id": 1520,
        "name": "培元丹丹方",
        "grade": 2,
        "productId": 1220,
        "turns": 3,
        "cost": { "1310": 2, "1314": 2 },
        "desc": "用于稳固修炼根基的二品丹方。"
    }
  ],
  "Smithing": [
    {
      "id": 1600,
      "name": "凡铁剑剑谱",
      "grade": 1,
      "productId": 1100,
      "turns": 1,
      "cost": { 1400: 10 }, // 精铁
      "desc": "凡人武者常用的铁剑，由精金石打造，削铁如泥，锋利无比。"
    }
  ]
};