export const RECIPES_DATA = {
  "Alchemy": [
    {
       "id": 60000,
       "name": "养元散丹方",
       "grade": 0,
       "productId": 30300,
       "turns": 1,
       "cost": { "40102": 4, "40100": 3 },
       "desc": "温养经脉，恢复气血，适合初入修行者调理根基。"
    },
    {
      "id": 60100,
      "name": "凝气丹丹方",
      "grade": 1,
      "productId": 30102,
      "turns": 1,
      "cost": { "40100": 5, "40101": 2 }, // 灵谷草, 清灵花
      "desc": "提练气修士精进修为的资粮。丹内锁有一团纯净的灵雾，吞服后可省却数月打坐吐纳之功，乃是望月湖各大家族争相囤积的战略物资。"
    },
    {
        "id": 60101,
        "name": "回气丸丹方",
        "grade": 1,
        "productId": 30400,
        "turns": 1,
        "cost": { "40101": 3, "40103": 1 },
        "desc": "短时间内回复灵力，常备于外出历练之时。"
    },
    {
        "id": 60001,
        "name": "健体丹丹方",
        "grade": 0,
        "productId": 30401,
        "turns": 1,
        "cost": { "40104": 5 },
        "desc": "强筋健骨，改善凡人体魄，为踏入修行打下基础。"
    },
    {
        "id": 60102,
        "name": "清心丸丹方",
        "grade": 1,
        "productId": 30600,
        "turns": 1,
        "cost": { "40101": 2, "40105": 2 },
        "desc": "安神定志，减少修炼时心浮气躁的风险。"
    },
    {
        "id": 60200,
        "name": "培元丹丹方",
        "grade": 2,
        "productId": 30201,
        "turns": 3,
        "cost": { "40200": 2, "40204": 2 },
        "desc": "用于稳固修炼根基的二品丹方。"
    }
  ],
  "Smithing": [
    {
      "id": 60103,
      "name": "凡铁剑剑谱",
      "grade": 0,
      "productId": 20100,
      "turns": 1,
      "cost": { "50100": 10 }, // 精铁
      "desc": "凡人武者常用的铁剑，由精金石打造，削铁如泥，锋利无比。"
    }
  ]
};